app/views/users/_deployments.html.erb

  <%= render :partial => 'deployments/list_item', :locals => {:deployments => @deployments} %>
  <% if @deployments.size != @user.deployments.count %>
---
SELECT COUNT(*) FROM "deployments" WHERE "deployments"."user_id" = 1