app/views/projects/_configs.html.erb

SELECT "configuration_parameters".* FROM "configuration_parameters" WHERE "configuration_parameters"."type" IN ('ProjectConfiguration') AND "configuration_parameters"."project_id" = 1 ORDER BY name ASC
SELECT COUNT(*) FROM "configuration_parameters" WHERE "configuration_parameters"."type" IN ('ProjectConfiguration') AND "configuration_parameters"."project_id" = 1
---
<% if @project.configuration_parameters.empty? %>