app/views/projects/_stages.html.erb

        <td><%= stage.hosts.count  %></td>
        <td><%= stage.deployments.count  %></td>
---
SELECT COUNT(*) FROM "deployments" WHERE "deployments"."stage_id" = 1