app/views/stages/_configs.html.erb

SELECT "configuration_parameters".* FROM "configuration_parameters" WHERE "configuration_parameters"."type" IN ('StageConfiguration') AND "configuration_parameters"."stage_id" = 1 ORDER BY name ASC
---
<% if @stage.configuration_parameters.empty? %>