app/views/stages/_recipes.html.erb

<% if @stage.recipes.empty? %>
---
SELECT "recipes".* FROM "recipes" INNER JOIN "recipes_stages" ON "recipes"."id" = "recipes_stages"."recipe_id" WHERE "recipes_stages"."stage_id" = 1