app/views/stages/_roles.html.erb

SELECT "roles".* FROM "roles" WHERE "roles"."stage_id" = 1 ORDER BY name ASC
---
          <td><%= role.ssh_port || t("role.default") %></td>
          <td><%= role.role_attribute_hash.inspect unless role.role_attribute_hash.blank?  %></td>