app/controllers/deployments_controller.rb

SELECT "deployments".* FROM "deployments" WHERE "deployments"."stage_id" = 1 AND "deployments"."id" = ? ORDER BY created_at DESC LIMIT 1  [["id", "5"]]
---
  def show
    @deployment = @stage.deployments.find(params[:id])