app/controllers/projects_controller.rb

  def show
    @project = Project.find(params[:id])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = ? LIMIT 1  [["id", "1"]]

  def load_clone_original
    if params[:clone]
      @original = Project.unscoped.find(params[:clone])
---
SELECT "projects".* FROM "projects" WHERE "projects"."id" = 1 LIMIT 1