app/controllers/stages_controller.rb

SELECT "stages".* FROM "stages" WHERE "stages"."project_id" = 1 AND "stages"."id" = ? ORDER BY name ASC LIMIT 1  [["id", "1"]]
---
  def show
    @stage = current_project.stages.find(params[:id])