app/views/layouts/_hosts.html.erb

SELECT "hosts".* FROM "hosts" ORDER BY name ASC
SELECT COUNT(*) FROM "hosts"
---
<div id="hosts_open_content" style="<%= show_if_opened(status) %>">
  <% if Host.count > 0 %>