app/views/layouts/_projects.html.erb

<div id="projects_open_content" style="<%= show_if_opened(status) %>">
  <% if Project.count > 0 %>
---
SELECT "projects".* FROM "projects" ORDER BY name ASC
SELECT COUNT(*) FROM "projects"

      <div id="<%= dom_id(project) %>_stages" style="<%= show_stages_of_project(project) %>">
        <% if project.stages.count > 0 %>
---
SELECT "stages".* FROM "stages" WHERE "stages"."project_id" = 1 ORDER BY name ASC
SELECT COUNT(*) FROM "stages" WHERE "stages"."project_id" = 1