app/views/layouts/_recipes.html.erb

<div id="recipes_open_content" style="<%= show_if_opened(status) %>">
  <% if Recipe.count > 0 %>
---
SELECT "recipes".* FROM "recipes" ORDER BY name ASC
SELECT COUNT(*) FROM "recipes"