app/views/layouts/_users.html.erb

SELECT "users".* FROM "users" ORDER BY login ASC
SELECT COUNT(*) FROM "users"
---
<div id="users_open_content" style="<%= show_if_opened(status) %>">
  <% if User.count > 0 %>